tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "awscli"
brew "curl"
brew "gh"
brew "jq"
brew "mas"
brew "node"
cask "blackhole-16ch"
cask "nova"
cask "obs"
cask "transmit"
cask "imageoptim"
cask "amazon-chime"
cask "mongodb-compass"

# Apple
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694

# Microsoft
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "Microsoft Outlook", id: 985367838

# Others
mas "Pastebot", id: 1179623856
mas "Pixelmator Pro", id: 1289583905
mas "Pluralsight", id: 431748264
mas "Telegram", id: 747648890
mas "Agenda", id: 1287445660
mas "Things 3", id: 904280696

# Xcode as last to not lock PC for hours
mas "Xcode", id: 497799835

# Install docker at the end, as it require root password
ask "docker"
